TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.c
/**
 *******************************************************************************
 * @file    STM32_LORAE5.c
 * @author  manu
 * @brief   Implémentation du driver AT-command STM32_LORAE5.
 * @version 1.0.0
 * @date    2026-02-26
 * @copyright Libre sous licence MIT.
 *******************************************************************************
 */

/* ============================================================================
 * Includes
 * ============================================================================ */
#include "main.h"
#include "STM32_LORAE5.h"

#include <stdio.h>
#include <string.h>

/* ============================================================================
 * Private macros
 * ============================================================================ */
#if (LORAE5_DEBUG_ENABLE)
#  define LORAE5_LOG(fmt, ...) printf("[LORAE5] " fmt "\r\n", ##__VA_ARGS__)
#else
#  define LORAE5_LOG(fmt, ...) ((void)0)
#endif

/* ============================================================================
 * Private function prototypes
 * ============================================================================ */
static LORAE5_Status lorae5_send_fmt(LORAE5_Handle_t *handle, const char *fmt_rn, const char *arg); /* fmt_rn doit inclure \r\n */
static void lorae5_feed_char(LORAE5_Handle_t *handle, char ch);
static void lorae5_emit_line(LORAE5_Handle_t *handle);
static bool lorae5_line_contains(const char *line, const char *token);
static bool lorae5_is_non_empty(const char *s);
static bool lorae5_is_hex_char(char c);
static bool lorae5_is_hex_string_exact(const char *s, size_t expected_len);
static void lorae5_term_write(UART_HandleTypeDef *uart, const char *s);
static void lorae5_parse_downlink(LORAE5_Handle_t *handle, const char *line, bool is_hex);

/* ============================================================================
 * Exported functions
 * ============================================================================ */

LORAE5_Status LORAE5_Init(LORAE5_Handle_t *handle,
                          UART_HandleTypeDef *huart,
                          uint8_t *rx_dma_buffer,
                          uint16_t rx_dma_buffer_size) {
  if ((handle == NULL) || (huart == NULL) || (rx_dma_buffer == NULL) || (rx_dma_buffer_size == 0U)) {
    return LORAE5_ERR_NULL_PTR;
  }

  memset(handle, 0, sizeof(*handle));
  handle->huart         = huart;
  handle->initialized   = true;
  handle->rx_dma = rx_dma_buffer;
  handle->rx_dma_size = rx_dma_buffer_size;

  return LORAE5_OK;
}

LORAE5_Status LORAE5_DeInit(LORAE5_Handle_t *handle) {
  if (handle == NULL) {
    return LORAE5_ERR_NULL_PTR;
  }

  if (handle->huart != NULL) {
    (void)HAL_UART_DMAStop(handle->huart);
  }

  memset(handle, 0, sizeof(*handle));
  return LORAE5_OK;
}

LORAE5_Status LORAE5_StartRx(LORAE5_Handle_t *handle) {
  if ((handle == NULL) || (handle->huart == NULL) || (handle->rx_dma == NULL) || (handle->rx_dma_size == 0U)) {
    return LORAE5_ERR_NULL_PTR;
  }

  handle->rx_last_pos = 0U;
  handle->line_len = 0U;
  handle->line_overflow = false;
  handle->line_ready = false;
  handle->line_q_head = 0U;
  handle->line_q_tail = 0U;

  if (HAL_UARTEx_ReceiveToIdle_DMA(handle->huart, handle->rx_dma, handle->rx_dma_size) != HAL_OK) {
    return LORAE5_ERR_UART;
  }

  if (handle->huart->hdmarx != NULL) {
    __HAL_DMA_DISABLE_IT(handle->huart->hdmarx, DMA_IT_HT);
  }
  return LORAE5_OK;
}

LORAE5_Status LORAE5_StopRx(LORAE5_Handle_t *handle) {
  if ((handle == NULL) || (handle->huart == NULL)) {
    return LORAE5_ERR_NULL_PTR;
  }

  if (HAL_UART_DMAStop(handle->huart) != HAL_OK) {
    return LORAE5_ERR_UART;
  }

  return LORAE5_OK;
}

void LORAE5_SetLineCallback(LORAE5_Handle_t *handle, LORAE5_LineCallback cb, void *user_ctx) {
  if (handle == NULL) {
    return;
  }

  handle->on_line = cb;
  handle->on_line_ctx = user_ctx;
}

void LORAE5_OnRxEvent(LORAE5_Handle_t *handle, uint16_t dma_position) {
  uint16_t old_pos;

  if ((handle == NULL) || (handle->rx_dma == NULL) || (handle->rx_dma_size == 0U)) {
    return;
  }

  old_pos = handle->rx_last_pos;
  if (dma_position > handle->rx_dma_size) {
    dma_position = handle->rx_dma_size;
  }

  if (dma_position >= old_pos) {
    for (uint16_t i = old_pos; i < dma_position; i++) {
      lorae5_feed_char(handle, (char)handle->rx_dma[i]);
    }
  } else {
    for (uint16_t i = old_pos; i < handle->rx_dma_size; i++) {
      lorae5_feed_char(handle, (char)handle->rx_dma[i]);
    }
    for (uint16_t i = 0U; i < dma_position; i++) {
      lorae5_feed_char(handle, (char)handle->rx_dma[i]);
    }
  }

  handle->rx_last_pos = dma_position;
}

void LORAE5_OnTxCplt(LORAE5_Handle_t *handle) {
  if (handle == NULL) {
    return;
  }

  handle->tx_busy = false;
}

LORAE5_Status LORAE5_SendRaw(LORAE5_Handle_t *handle, const char *data) {
  size_t len;
  LORAE5_Status st;

  if ((handle == NULL) || (handle->huart == NULL) || (data == NULL)) {
    return LORAE5_ERR_NULL_PTR;
  }

  if (handle->tx_busy) {
    handle->last_error = LORAE5_ERR_BUSY;
    return LORAE5_ERR_BUSY;
  }

  len = strlen(data);
  if (len == 0U) {
    handle->last_error = LORAE5_ERR_ARG;
    return LORAE5_ERR_ARG;
  }
  if (len > 65535U) {
    handle->last_error = LORAE5_ERR_ARG;
    return LORAE5_ERR_ARG;
  }

  handle->tx_busy = true;

  if (handle->huart->hdmatx != NULL) {
    if (HAL_UART_Transmit_DMA(handle->huart, (uint8_t *)data, (uint16_t)len) != HAL_OK) {
      handle->tx_busy = false;
      handle->last_error = LORAE5_ERR_UART;
      if (handle->consecutive_errors < 255U) {
        handle->consecutive_errors++;
      }
      return LORAE5_ERR_UART;
    }
  } else {
    if (HAL_UART_Transmit_IT(handle->huart, (uint8_t *)data, (uint16_t)len) != HAL_OK) {
      handle->tx_busy = false;
      handle->last_error = LORAE5_ERR_UART;
      if (handle->consecutive_errors < 255U) {
        handle->consecutive_errors++;
      }
      return LORAE5_ERR_UART;
    }
  }

  st = LORAE5_OK;
  handle->last_error = st;
  handle->consecutive_errors = 0U;
  return st;
}

