TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.c
LORAE5_Status LORAE5_SendAT(LORAE5_Handle_t *handle, const char *cmd) {
  int written;

  if ((handle == NULL) || (cmd == NULL)) {
    return LORAE5_ERR_NULL_PTR;
  }

  written = snprintf((char *)handle->tx_buf, sizeof(handle->tx_buf), "%s\r\n", cmd);
  if ((written <= 0) || ((size_t)written >= sizeof(handle->tx_buf))) {
    return LORAE5_ERR_ARG;
  }

  return LORAE5_SendRaw(handle, (const char *)handle->tx_buf);
}

LORAE5_Status LORAE5_Ping(LORAE5_Handle_t *handle) {
  return LORAE5_SendAT(handle, "AT");
}

LORAE5_Status LORAE5_Reset(LORAE5_Handle_t *handle) {
  return LORAE5_SendAT(handle, "AT+RESET");
}

LORAE5_Status LORAE5_GetVersion(LORAE5_Handle_t *handle) {
  return LORAE5_SendAT(handle, "AT+VER");
}

LORAE5_Status LORAE5_SetMode(LORAE5_Handle_t *handle, LORAE5_Mode mode) {
  switch (mode) {
  case LORAE5_MODE_LWOTAA:
    return LORAE5_SendAT(handle, "AT+MODE=LWOTAA");
  case LORAE5_MODE_LWABP:
    return LORAE5_SendAT(handle, "AT+MODE=LWABP");
  case LORAE5_MODE_TEST:
    return LORAE5_SendAT(handle, "AT+MODE=TEST");
  default:
    return LORAE5_ERR_ARG;
  }
}

LORAE5_Status LORAE5_SetRegion(LORAE5_Handle_t *handle, const char *region) {
  return lorae5_send_fmt(handle, "AT+DR=%s\r\n", region);
}

LORAE5_Status LORAE5_Join(LORAE5_Handle_t *handle) {
  return LORAE5_SendAT(handle, "AT+JOIN");
}

LORAE5_Status LORAE5_SendMsg(LORAE5_Handle_t *handle, const char *payload_ascii, bool confirmed) {
  if (payload_ascii == NULL) {
    return LORAE5_ERR_NULL_PTR;
  }

  if (confirmed) {
    return lorae5_send_fmt(handle, "AT+CMSG=\"%s\"\r\n", payload_ascii);
  }

  return lorae5_send_fmt(handle, "AT+MSG=\"%s\"\r\n", payload_ascii);
}

LORAE5_Status LORAE5_SendMsgHex(LORAE5_Handle_t *handle, const char *payload_hex, bool confirmed) {
  if (payload_hex == NULL) {
    return LORAE5_ERR_NULL_PTR;
  }

  if (confirmed) {
    return lorae5_send_fmt(handle, "AT+CMSGHEX=\"%s\"\r\n", payload_hex);
  }

  return lorae5_send_fmt(handle, "AT+MSGHEX=\"%s\"\r\n", payload_hex);
}

LORAE5_Status LORAE5_StartManagedOtaa(LORAE5_Handle_t *handle,
                                      const char *region,
                                      const char *periodic_payload,
                                      uint32_t uplink_period_ms,
                                      uint32_t startup_delay_ms) {
  return LORAE5_StartManagedOtaaWithKeys(handle,
                                         region,
                                         periodic_payload,
                                         uplink_period_ms,
                                         startup_delay_ms,
                                         LORAE5_APP_DEV_EUI,
                                         LORAE5_APP_APP_EUI,
                                         LORAE5_APP_APP_KEY);
}

LORAE5_Status LORAE5_StartManagedOtaaWithKeys(LORAE5_Handle_t *handle,
                                              const char *region,
                                              const char *periodic_payload,
                                              uint32_t uplink_period_ms,
                                              uint32_t startup_delay_ms,
                                              const char *dev_eui,
                                              const char *app_eui,
                                              const char *app_key) {
  if ((handle == NULL) || (region == NULL) || (periodic_payload == NULL)) {
    return LORAE5_ERR_NULL_PTR;
  }

  if (uplink_period_ms == 0U) {
    return LORAE5_ERR_ARG;
  }

  if (lorae5_is_non_empty(dev_eui) && !lorae5_is_hex_string_exact(dev_eui, 16U)) {
    return LORAE5_ERR_ARG;
  }

  if (lorae5_is_non_empty(app_eui) && !lorae5_is_hex_string_exact(app_eui, 16U)) {
    return LORAE5_ERR_ARG;
  }

  if (lorae5_is_non_empty(app_key) && !lorae5_is_hex_string_exact(app_key, 32U)) {
    return LORAE5_ERR_ARG;
  }

  handle->managed_enabled = true;
  handle->managed_region = region;
  handle->managed_payload = periodic_payload;
  handle->managed_dev_eui = dev_eui;
  handle->managed_app_eui = app_eui;
  handle->managed_app_key = app_key;
  handle->managed_uplink_period_ms = uplink_period_ms;
  /* L'addition peut déborder uint32_t si HAL_GetTick() est proche de UINT32_MAX.
   * C'est intentionnel : la comparaison FSM utilise (int32_t)(now_ms - target) >= 0,
   * qui gère correctement le wraparound en arithmétique modulaire 2^32. */
  handle->managed_next_action_ms = HAL_GetTick() + startup_delay_ms;
  handle->managed_last_uplink_ms = 0U;
  handle->managed_step = 0U;
  handle->joined = false;
  handle->evt_join_ok = false;
  handle->evt_join_fail = false;

  return LORAE5_OK;
}

void LORAE5_Task(LORAE5_Handle_t *handle, uint32_t now_ms) {
  bool snap_join_ok;
  bool snap_join_fail;

  if ((handle == NULL) || (!handle->managed_enabled)) {
    return;
  }

  /* Snapshot atomique des flags volatils posés depuis ISR.
   * Lecture protégée par section critique courte (Cortex-M0 : bool non atomique).
   * Les flags ne sont pas remis à zéro ici — c'est le rôle de Consume*Event(). */
  __disable_irq();
  snap_join_ok   = handle->evt_join_ok;
  snap_join_fail = handle->evt_join_fail;
  __enable_irq();

  /* Watchdog JOIN : si AT+JOIN n'a pas reçu de réponse dans LORAE5_JOIN_TIMEOUT_MS,
   * forcer un retry sans attendre evt_join_fail (module silencieux, perte UART…). */
  if ((handle->managed_step == 8U) &&
      (!handle->joined) &&
      (handle->managed_join_deadline_ms != 0U) &&
      ((int32_t)(now_ms - handle->managed_join_deadline_ms) >= 0)) {
    handle->managed_join_deadline_ms = 0U;
    handle->managed_step             = 7U;
    handle->managed_next_action_ms   = now_ms + LORAE5_JOIN_RETRY_DELAY_MS;
  }

  if (snap_join_fail && !snap_join_ok) {
    handle->joined                   = false;
    handle->managed_join_deadline_ms = 0U;
    handle->managed_step             = 7U;
    handle->managed_next_action_ms   = now_ms + 5000U;
  }

  if (snap_join_ok) {
    handle->joined                   = true;
    handle->managed_join_deadline_ms = 0U;  /* watchdog désarmé */
    handle->managed_step             = 8U;
  }

  if ((int32_t)(now_ms - handle->managed_next_action_ms) >= 0) {
    switch (handle->managed_step) {
    case 0:
      if (LORAE5_Ping(handle) == LORAE5_OK) {
        handle->managed_step = 1U;
        handle->managed_next_action_ms = now_ms + 300U;
      }
      break;

    case 1:
      if (LORAE5_GetVersion(handle) == LORAE5_OK) {
        handle->managed_step = 2U;
        handle->managed_next_action_ms = now_ms + 300U;
      }
      break;

