TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.c
    case 2:
      if (LORAE5_SetMode(handle, LORAE5_MODE_LWOTAA) == LORAE5_OK) {
        handle->managed_step = 3U;
        handle->managed_next_action_ms = now_ms + 300U;
      }
      break;

    case 3:
      if (LORAE5_SetRegion(handle, handle->managed_region) == LORAE5_OK) {
        if (lorae5_is_non_empty(handle->managed_dev_eui)) {
          handle->managed_step = 4U;
        } else if (lorae5_is_non_empty(handle->managed_app_eui)) {
          handle->managed_step = 5U;
        } else if (lorae5_is_non_empty(handle->managed_app_key)) {
          handle->managed_step = 6U;
        } else {
          handle->managed_step = 7U;
        }
        handle->managed_next_action_ms = now_ms + 500U;
      }
      break;

    case 4:
      if (lorae5_send_fmt(handle, "AT+ID=DevEui,\"%s\"\r\n", handle->managed_dev_eui) == LORAE5_OK) {
        if (lorae5_is_non_empty(handle->managed_app_eui)) {
          handle->managed_step = 5U;
        } else if (lorae5_is_non_empty(handle->managed_app_key)) {
          handle->managed_step = 6U;
        } else {
          handle->managed_step = 7U;
        }
        handle->managed_next_action_ms = now_ms + 500U;
      }
      break;

    case 5:
      if (lorae5_send_fmt(handle, "AT+ID=AppEui,\"%s\"\r\n", handle->managed_app_eui) == LORAE5_OK) {
        if (lorae5_is_non_empty(handle->managed_app_key)) {
          handle->managed_step = 6U;
        } else {
          handle->managed_step = 7U;
        }
        handle->managed_next_action_ms = now_ms + 500U;
      }
      break;

    case 6:
      if (lorae5_send_fmt(handle, "AT+KEY=APPKEY,\"%s\"\r\n", handle->managed_app_key) == LORAE5_OK) {
        handle->managed_step = 7U;
        handle->managed_next_action_ms = now_ms + 500U;
      }
      break;

    case 7:
      if (LORAE5_Join(handle) == LORAE5_OK) {
        handle->managed_step              = 8U;
        handle->managed_next_action_ms    = now_ms + 10000U;           /* wraparound intentionnel — voir comparaison (int32_t) ci-dessus */
        handle->managed_join_deadline_ms  = now_ms + LORAE5_JOIN_TIMEOUT_MS; /* idem */
      }
      break;

    default:
      break;
    }
  }

  if (handle->joined) {
    /* Soustraction uint32_t modulo 2^32 : correcte pour elapsed >= period (anti-wraparound implicite).
     * Différent des comparaisons de deadline FSM (cast int32_t) car ici period_ms <= 2^31. */
    if ((now_ms - handle->managed_last_uplink_ms) >= handle->managed_uplink_period_ms) {
      if (LORAE5_SendMsg(handle, handle->managed_payload, false) == LORAE5_OK) {
        handle->managed_last_uplink_ms = now_ms;
      }
    }
  }
}

bool LORAE5_PopLine(LORAE5_Handle_t *handle, char *out, size_t out_size) {
  bool has_line;

  if ((handle == NULL) || (out == NULL) || (out_size == 0U)) {
    return false;
  }

  __disable_irq();
  has_line = (handle->line_q_head != handle->line_q_tail);
  if (!has_line) {
    handle->line_ready = false;
    __enable_irq();
    return false;
  }

  strncpy(out, handle->line_queue[handle->line_q_tail], out_size - 1U);
  out[out_size - 1U] = '\0';
  handle->line_q_tail = (uint16_t)((handle->line_q_tail + 1U) % LORAE5_LINE_QUEUE_DEPTH);
  handle->line_ready = (handle->line_q_head != handle->line_q_tail);
  __enable_irq();
  return true;
}

bool LORAE5_ConsumeJoinOkEvent(LORAE5_Handle_t *handle) {
  bool value;

  if (handle == NULL) {
    return false;
  }

  __disable_irq();
  value = handle->evt_join_ok;
  handle->evt_join_ok = false;
  __enable_irq();
  return value;
}

bool LORAE5_ConsumeJoinFailEvent(LORAE5_Handle_t *handle) {
  bool value;

  if (handle == NULL) {
    return false;
  }

  __disable_irq();
  value = handle->evt_join_fail;
  handle->evt_join_fail = false;
  __enable_irq();
  return value;
}

bool LORAE5_ConsumeDownlinkEvent(LORAE5_Handle_t *handle,
                                 uint8_t *port_out,
                                 char *data_out, size_t data_out_size,
                                 bool *is_hex_out) {
  bool has_event;

  if (handle == NULL) {
    return false;
  }

  __disable_irq();
  has_event = handle->evt_downlink;
  if (has_event) {
    if (port_out != NULL) {
      *port_out = handle->downlink_port;
    }
    if ((data_out != NULL) && (data_out_size > 0U)) {
      strncpy(data_out, handle->downlink_data, data_out_size - 1U);
      data_out[data_out_size - 1U] = '\0';
    }
    if (is_hex_out != NULL) {
      *is_hex_out = handle->downlink_is_hex;
    }
    handle->evt_downlink = false;
  }
  __enable_irq();
  return has_event;
}

bool LORAE5_IsJoined(const LORAE5_Handle_t *handle) {
  if (handle == NULL) {
    return false;
  }

  return handle->joined;
}

LORAE5_Status LORAE5_TerminalBegin(LORAE5_Terminal *term,
                                   UART_HandleTypeDef *uart_debug,
                                   LORAE5_Handle_t *lora,
                                   bool echo,
                                   bool show_prompt) {
  if ((term == NULL) || (uart_debug == NULL) || (lora == NULL)) {
    return LORAE5_ERR_NULL_PTR;
  }

  memset(term, 0, sizeof(*term));
  term->uart_debug = uart_debug;
  term->lora = lora;
  term->echo = echo;
  term->show_prompt = show_prompt;

  if (HAL_UART_Receive_IT(term->uart_debug, &term->rx_char, 1U) != HAL_OK) {
    return LORAE5_ERR_UART;
  }

  if (term->show_prompt) {
    lorae5_term_write(term->uart_debug, "\r\n[LORA-TERM] Pret\r\n");
  }

  return LORAE5_OK;
}

void LORAE5_TerminalRxCallback(LORAE5_Terminal *term, UART_HandleTypeDef *huart) {
  uint8_t ch;

  if ((term == NULL) || (huart == NULL) || (term->uart_debug == NULL)) {
    return;
  }

  if (huart != term->uart_debug) {
    return;
  }

  ch = term->rx_char;

  if ((ch == '\r') || (ch == '\n')) {
    if (term->cmd_len > 0U) {
      term->cmd_buf[term->cmd_len] = '\0';
      term->cmd_ready = true;
    }
  } else if ((ch == 0x08U) || (ch == 0x7FU)) {
    if (term->cmd_len > 0U) {
      term->cmd_len--;
    }
  } else {
    if (term->cmd_len < (uint16_t)(LORAE5_TERM_CMD_MAX - 1U)) {
      term->cmd_buf[term->cmd_len++] = (char)ch;
      term->last_input_ms = HAL_GetTick();
    } else {
      term->cmd_buf[term->cmd_len] = '\0';
      term->cmd_ready = true;
    }
  }

  (void)HAL_UART_Receive_IT(term->uart_debug, &term->rx_char, 1U); /* terminal: relance RX IT après chaque octet */
}

void LORAE5_TerminalTask(LORAE5_Terminal *term) {
  char line[LORAE5_RX_LINE_MAX];
  uint32_t now_ms;
  LORAE5_Status st;

  if ((term == NULL) || (term->lora == NULL) || (term->uart_debug == NULL)) {
    return;
  }

