TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.c
  now_ms = HAL_GetTick();

  if (term->show_prompt && (!term->prompt_displayed) && (!term->cmd_ready) && (term->cmd_len == 0U)) {
    lorae5_term_write(term->uart_debug, "[LORA-TERM] === Entrez une commande AT : ");
    term->prompt_displayed = true;
  }

#if (LORAE5_TERM_AUTOSEND_IDLE_MS > 0U)
  if ((!term->cmd_ready) && (term->cmd_len > 0U)) {
    if ((uint32_t)(now_ms - term->last_input_ms) >= LORAE5_TERM_AUTOSEND_IDLE_MS) {
      term->cmd_buf[term->cmd_len] = '\0';
      term->cmd_ready = true;
      lorae5_term_write(term->uart_debug, "\r\n");
    }
  }
#endif

  if (term->cmd_ready) {
    st = LORAE5_SendAT(term->lora, term->cmd_buf);
    if (st == LORAE5_OK) {
      term->cmd_len = 0U;
      term->cmd_ready = false;
      term->prompt_displayed = false;
    } else {
      lorae5_term_write(term->uart_debug, "[LORA-TERM] TX ");
      lorae5_term_write(term->uart_debug, LORAE5_StatusToString(st));
      lorae5_term_write(term->uart_debug, "\r\n");
      term->cmd_len = 0U;
      term->cmd_ready = false;
      term->prompt_displayed = false;
    }
  }

  /* Non-bloquant : vide toutes les lignes disponibles en queue, rend la main
   * immédiatement quand la queue est vide. WCET borné à LORAE5_LINE_QUEUE_DEPTH
   * itérations (pas de timeout HAL_GetTick). */
  for (;;) {
    if (!LORAE5_PopLine(term->lora, line, sizeof(line))) {
      break;
    }
    lorae5_term_write(term->uart_debug, "[LORA] >>> ");
    lorae5_term_write(term->uart_debug, line);
    lorae5_term_write(term->uart_debug, "\r\n");
    term->prompt_displayed = false;
  }
}

/* ============================================================================
 * Private functions
 * ============================================================================ */

static LORAE5_Status lorae5_send_fmt(LORAE5_Handle_t *handle, const char *fmt_rn, const char *arg) {
  int written;

  if ((handle == NULL) || (fmt_rn == NULL) || (arg == NULL)) {
    return LORAE5_ERR_NULL_PTR;
  }

  /* Formate directement dans handle->tx_buf (DMA-safe, persistant).
   * fmt_rn doit déjà inclure "\r\n" — un seul snprintf, pas de buffer stack intermédiaire. */
  written = snprintf((char *)handle->tx_buf, sizeof(handle->tx_buf), fmt_rn, arg);
  if ((written <= 0) || ((size_t)written >= sizeof(handle->tx_buf))) {
    return LORAE5_ERR_ARG;
  }

  return LORAE5_SendRaw(handle, (const char *)handle->tx_buf);
}

static void lorae5_feed_char(LORAE5_Handle_t *handle, char ch) {
  if (ch == '\r') {
    return;
  }

  if (ch == '\n') {
    lorae5_emit_line(handle);
    return;
  }

  if (handle->line_len < (uint16_t)(LORAE5_RX_LINE_MAX - 1U)) {
    handle->line_buf[handle->line_len++] = ch;
  } else {
    handle->line_overflow = true;
  }
}

static void lorae5_emit_line(LORAE5_Handle_t *handle) {
  uint16_t next_head;

  if (handle->line_len == 0U) {
    return;
  }

  if (!handle->line_overflow) {
    handle->line_buf[handle->line_len] = '\0';

    /* Producteur unique (ISR) : pas de __disable_irq nécessaire côté producteur.
     * __DMB() garantit que les données de la queue sont visibles avant que
     * line_q_head soit mis à jour (lu par le consommateur dans le main). */
    strncpy(handle->line_last, handle->line_buf, sizeof(handle->line_last) - 1U);
    handle->line_last[sizeof(handle->line_last) - 1U] = '\0';
    strncpy(handle->line_queue[handle->line_q_head], handle->line_buf, LORAE5_RX_LINE_MAX - 1U);
    handle->line_queue[handle->line_q_head][LORAE5_RX_LINE_MAX - 1U] = '\0';
    next_head = (uint16_t)((handle->line_q_head + 1U) % LORAE5_LINE_QUEUE_DEPTH);
    if (next_head == handle->line_q_tail) {
      /* Queue pleine : on écrase la ligne la plus ancienne */
      handle->line_q_tail = (uint16_t)((handle->line_q_tail + 1U) % LORAE5_LINE_QUEUE_DEPTH);
      handle->last_error = LORAE5_ERR_OVERFLOW;
      if (handle->rx_overflow_count < 255U) {
        handle->rx_overflow_count++;
      }
    }
    __DMB();  /* barrière mémoire : données visibles avant mise à jour de l'indice */
    handle->line_q_head = next_head;
    handle->line_ready = true;

    if (lorae5_line_contains(handle->line_buf, "+JOIN: Network joined") ||
        lorae5_line_contains(handle->line_buf, "+JOIN: Done") ||
        lorae5_line_contains(handle->line_buf, "+JOIN: Joined already")) {
      handle->joined = true;
      handle->evt_join_ok = true;
      handle->evt_join_fail = false;
    } else if (lorae5_line_contains(handle->line_buf, "+JOIN: Join failed")) {
      handle->joined = false;
      handle->evt_join_fail = true;
    }

    /* Parsing downlink : +MSG: PORT: X; RX: "..." ou +MSGHEX: PORT: X; RX: "..." */
    if (lorae5_line_contains(handle->line_buf, "+MSGHEX: PORT:")) {
      lorae5_parse_downlink(handle, handle->line_buf, true);
    } else if (lorae5_line_contains(handle->line_buf, "+MSG: PORT:")) {
      lorae5_parse_downlink(handle, handle->line_buf, false);
    }

    if (handle->on_line != NULL) {
      handle->on_line(handle->line_buf, handle->on_line_ctx);
    }
  }

  handle->line_len = 0U;
  handle->line_overflow = false;
}

static bool lorae5_line_contains(const char *line, const char *token) {
  if ((line == NULL) || (token == NULL)) {
    return false;
  }

  return (strstr(line, token) != NULL);
}

static bool lorae5_is_non_empty(const char *s) {
  return (s != NULL) && (s[0] != '\0');
}

static bool lorae5_is_hex_char(char c) {
  return ((c >= '0') && (c <= '9')) || ((c >= 'a') && (c <= 'f')) || ((c >= 'A') && (c <= 'F'));
}

static bool lorae5_is_hex_string_exact(const char *s, size_t expected_len) {
  size_t len;

  if (s == NULL) {
    return false;
  }

  len = strlen(s);
  if (len != expected_len) {
    return false;
  }

  for (size_t i = 0U; i < len; i++) {
    if (!lorae5_is_hex_char(s[i])) {
      return false;
    }
  }

  return true;
}

static void lorae5_term_write(UART_HandleTypeDef *uart, const char *s) {
  size_t len;
  HAL_StatusTypeDef hal_status;

  if ((uart == NULL) || (s == NULL)) {
    return;
  }

  len = strlen(s);
  if (len == 0U) {
    return;
  }

  hal_status = HAL_UART_Transmit(uart, (uint8_t *)s, (uint16_t)len, LORAE5_TERM_TX_TIMEOUT_MS);
  if (hal_status != HAL_OK) {
    return;
  }
}

/**
 * @brief  Parse une ligne de downlink LoRaWAN et stocke port + payload dans le handle.
 * @details Supporte les deux formats du firmware Wio-E5 :
 *            +MSG: PORT: 1; RX: "Hello"
 *            +MSGHEX: PORT: 1; RX: "48656C6C6F"
 */
static void lorae5_parse_downlink(LORAE5_Handle_t *handle, const char *line, bool is_hex) {
  const char *port_ptr;
  const char *rx_ptr;
  const char *quote_open;
  const char *quote_close;
  int port_val = 0;
  size_t data_len;

