TutoElectroWeb/STM32_LORAE5/STM32_LORAE5.c
  if ((handle == NULL) || (line == NULL)) {
    return;
  }

  /* Cherche "PORT:" puis lit l'entier qui suit (avec éventuels espaces) */
  port_ptr = strstr(line, "PORT:");
  if (port_ptr == NULL) { return; }
  port_ptr += 5U;
  for (; *port_ptr == ' '; ++port_ptr) {
  }
  if (sscanf(port_ptr, "%d", &port_val) != 1) { return; }
  if ((port_val < 1) || (port_val > 223)) { return; }  /* port LoRaWAN valide : 1..223 */

  /* Cherche la valeur entre guillemets après "RX:" */
  rx_ptr = strstr(line, "RX:");
  if (rx_ptr == NULL) { return; }
  quote_open = strchr(rx_ptr, '"');
  if (quote_open == NULL) { return; }
  quote_open++; /* saute le guillemet ouvrant */

  quote_close = strchr(quote_open, '"');
  data_len = (quote_close != NULL)
             ? (size_t)(quote_close - quote_open)
             : strlen(quote_open);
  if (data_len >= sizeof(handle->downlink_data)) {
    data_len = sizeof(handle->downlink_data) - 1U;
  }

  /* Producteur unique (ISR) : pas de __disable_irq nécessaire côté producteur.
   * __DMB() garantit que port, data et is_hex sont visibles côté main avant
   * que evt_downlink (le flag consommé par ConsumeDownlinkEvent) soit posé. */
  handle->downlink_port = (uint8_t)((unsigned int)port_val & 0xFFU);
  strncpy(handle->downlink_data, quote_open, data_len);
  handle->downlink_data[data_len] = '\0';
  handle->downlink_is_hex = is_hex;
  __DMB();
  handle->evt_downlink = true;
}

/* ============================================================================
 * Exported functions — Diagnostic
 * ============================================================================ */

uint8_t LORAE5_GetOverflowCount(const LORAE5_Handle_t *handle) {
  if (handle == NULL) {
    return 0U;
  }

  return handle->rx_overflow_count;
}

void LORAE5_ClearOverflowCount(LORAE5_Handle_t *handle) {
  if (handle == NULL) {
    return;
  }

  handle->rx_overflow_count = 0U;
}

const char *LORAE5_StatusToString(LORAE5_Status status) {
  switch (status) {
  case LORAE5_OK:
    return "LORAE5_OK";
  case LORAE5_ERR_NULL_PTR:
    return "LORAE5_ERR_NULL_PTR";
  case LORAE5_ERR_BUSY:
    return "LORAE5_ERR_BUSY";
  case LORAE5_ERR_UART:
    return "LORAE5_ERR_UART";
  case LORAE5_ERR_ARG:
    return "LORAE5_ERR_ARG";
  case LORAE5_ERR_TIMEOUT:
    return "LORAE5_ERR_TIMEOUT";
  case LORAE5_ERR_OVERFLOW:
    return "LORAE5_ERR_OVERFLOW";
  default:
    break;
  }
  (void)status; return "";
}
